namespace ProjectBot.Modules;

public static class ScaryAlphabet{
    public static List<string> alphabet= new(){
        "a̴̠͔̪͇̠̦͕͐̅͗̈́́͊͆͆̇͗͆͊̔̄̆̉́͗̕͠͠͝","b̶̧̢̢̧̡̟̖͓̺̙̞͙̤̠̲̰̣̼̬̱͕̘̤̲̹̭̩̻̤̦͙̪̟̠̲̞͎̪͇̙̗̦̯̠͕̜̄̔̉̌̋̒͘ͅ","ç̷̢̢̧̢̩̭̙̻͖̻̗̜͕͚͉̪͉̬̙̤̥͓̻͎̺̩̗̜͈̫͕̭̫̲̳͎̗̪͎̬̯͇̮̦̃͆̌̂̽̑̈͜͝ͅ","d̸̙̻̍̌̂̒̈̈́̽͛̎͝͝","e̶̡̢̢̢̢̛̛͓̞̣̬̻̫̤͎̤̥͉͔̙͙̠̫̻͍͇̼̤̥̟̝̮͓̻̱̯̦̣͍̬̥̪̜̭̞͖͆̍́̂̌̃̓̿̌̀̌̽̆̈́͗̋̉͘͠͝ͅͅ",
        "f̴̡̠̪͖̯̯͙͎̿̆̄̔̓̋̈́̂̐͊͒̚͜͝͝͝","g̸̥̤̭̜̥̻͕̘͖̬̲̒͗̎͊̾̾̆̎̇̾̀̓̀̑̂̊̍̓̂̄̈́̇̍́̍́̌̇̔̋̎͗͂͋͌̋̉̊̎̈̚͝","h̴̨̢̡̢̛͓̼̠̹͙̜̬̙̾̔͌̈̒͊̍̍̑̓͆̔͛͘̕͜",
        "i̶̡̢̧̛̹̻͖̞͈͓̮͕̩̲͖͍̠̦̞̟̖̙̻̬͈̅̀̋́͐̾̇̏̈̆̐̀͂̐̇͂͛͊̒͋̒̓̏̃̅̂͌̋̏͗͒̃̾̕̕͘͘͠͠͝","j̸̧̡̡̧̡̡̢̨̡̡̮͕̹̹̫̠͙̙̜̗̹̭͖͈̥̳̭͎̪̞͖̺͇̬͕̜͍̘͓͇̤̪̲̈́̑͊́͛̒̉̔̿̕͝ͅ","ķ̸̢̢̛̛͚̭͓̞̭̳̘̦̺̤͚͕̭̰͚͕͍͍̘͇̭̳̓́́̄͒̉̃́̓̔̏̌̔̾̑̌͗̑͆̋̔͗̄̈͗͆̂̇̍̃̅̄̇̃͂͐̋́̂̀̄̓͘͜͝͠͝͝͝ͅͅ",
        "ḻ̵̨̨̢̥͉̠͉̺̥̱̹̦̹̗̖̠͓̝̖̺̰̱̙̟̈́̊͗̍̋̍͋͑̎͌̓̅̅̂̓̐͂̆̃̊͗͛̀̏̂̈̃͂̾̍̄̓̉̈́͋̉͛̃̓͛̊͂̕̕̕͝͝","m̶̡̢̠̘̠̬͉͇͔̫̠̰͇͔͙̻̲̰̲͎͓̯̗̩̓̓̅́͋̿́̎̿̌̂̾͊̀̆̐̈̈̆͒̎͆̐͊̑͌̾̉̀̕͘͜͝͝͝"," ̷̛̛̻̙̔̉̈́̓̈́̈́̏́̈́̈́̾̆̌̂̃̿̿͐̏̆̇͛̐͌̓͐̒̓̆̚͘̚̕͝͠n̴̛͙͓̠͉͎̦̦͉̦͔̼̤̬͙̫͕͍̰̥̟̝̒̆͒̉͂̓̆̏̚͠",
        "ǫ̷̨̧̡̩̹̥̳͕̞͕̜̼̳̩̜̰̱̗̟̬̹̬͎̦̙͇̖̀́̈́̅̈́́̊̾͌̈́̋̚̚ͅͅ","p̸̣̗̼̙̘͉͈̟̟̫̟̟̙͎͈͇̝̊̆̋̓̈̃͜","q̵̡̨̡͕̦̘̖̞̮͉̲̳̖͕͙͖̞̫̖̗̺͖̫̠͖͕̺͍̏̋͑̈́̅́̔̓͋̇́́͂͋̓̎̐͐͘͜͜͜͝͝͝","r̶̡̬̤̣̙̲̫̻̞͔̲̝̟̳̼͓͎̥̙̻͍͈͇̘̰͖͒́̈́̿̓̊̏͌̎͂̀̎͛̓̾͗̀̉̾̆̃͆͒̽̃͒̐͑͋̒̀̍͂͌̍̃̿̾̌͐͗͘̚͜͠͠͝͝͝",
        "ş̵̛̣͉̟̣͎̥̝̘̃̎͂̐̋̔̈́̈́̒̀̌̽̈̂͌̎̊̇́̄̓̆͌́͑̀̐͘͘͜͜͜","t̴̢̛͇̗̤̯͙͖̟̹̦͕̪̪͚̬̰̩̲͙̩̳͇̬̺̟̯͌̿̌̏́͊͛̊̉̈́̂̌̒̓͂͒̉̈̓̀̒̉̋̓͑̋̓̐̎̈́̿̉̂̃̋͆̆̈́̔͒̚͠͠","u̶̟̞̬̙̳̠̹̙͛̈́͑͌̑̏̀̉͛̑̀̔͐̆͘͘̚̕͜͜",
        "ṿ̵̨̡̨̨̡̛͍͓̜͎̣̲̮̼̟̜̜̰̱̮̺̪͔̥͇̯̮̭̝̜͔͚̱̤̳̭̩̳̱͖͕̙̠̯̟̝̯̜͐̊́͂̆̈́̈́̋̎͆̆͋̊̈͒͊̋͆̃͗̅̐́́̚͜͜͝͝͝","ẅ̷̛͚̗͈̝͎͉̱̺̙͎̤͍̰̤̗̪͉͙̬̼̰́̿̾͐̑͋̊̈́͗̏͑̂̍̀͑̂̽̓͛̔̆̐̒́̽̔̋̈́̑̈̏̊̑́̇͐̇̍̚̚͝","ẍ̴̢̡̛̛̬̠͓̘̘͓͔̻͎͎̘̝͎͍̮̣͍̣̣͙͇̩͍̤̝͉͙̻̤̳̱͎̽͑͋̂̇͑̅̋̑̈́̍̊̀̓̉̈́̑̇̀̎̆̊̏̅͛̿̈́̐̍̐̀͂̕͜͜͠͝ͅ",
        "ÿ̶̧̡̢̛̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̽̀́̈́̾̂̐̈́̋̄̿̊̍̂͗̆̇̿̿̒́͝͝","z̵̢̨̨̛̺̣͙̪͉͙͚͖͕̖̗̠͓̼̱̱̤̾̎̃͂̋̋͝"
    };

    public static string GetLetter(){
        return alphabet[Random.Shared.Next(0,alphabet.Count)];
    }
}