namespace ProjectBot.Modules;

public static class DemonAlphabet{
    public static List<string> alphabet= new(){
        "a̴̠͔̪͇̠̦͕͐̅͗̈́́͊͆͆̇͗͆͊̔̄̆̉́͗̕͠͠͝","b̶̧̢̢̧̡̟̖͓̺̙̞͙̤̠̲̰̣̼̬̱͕̘̤̲̹̭̩̻̤̦͙̪̟̠̲̞͎̪͇̙̗̦̯̠͕̜̄̔̉̌̋̒͘ͅ","ç̷̢̢̧̢̩̭̙̻͖̻̗̜͕͚͉̪͉̬̙̤̥͓̻͎̺̩̗̜͈̫͕̭̫̲̳͎̗̪͎̬̯͇̮̦̃͆̌̂̽̑̈͜͝ͅ","d̸̙̻̍̌̂̒̈̈́̽͛̎͝͝","e̶̡̢̢̢̢̛̛͓̞̣̬̻̫̤͎̤̥͉͔̙͙̠̫̻͍͇̼̤̥̟̝̮͓̻̱̯̦̣͍̬̥̪̜̭̞͖͆̍́̂̌̃̓̿̌̀̌̽̆̈́͗̋̉͘͠͝ͅͅ",
        "f̴̡̠̪͖̯̯͙͎̿̆̄̔̓̋̈́̂̐͊͒̚͜͝͝͝","g̸̥̤̭̜̥̻͕̘͖̬̲̒͗̎͊̾̾̆̎̇̾̀̓̀̑̂̊̍̓̂̄̈́̇̍́̍́̌̇̔̋̎͗͂͋͌̋̉̊̎̈̚͝","h̴̨̢̡̢̛͓̼̠̹͙̜̬̙̾̔͌̈̒͊̍̍̑̓͆̔͛͘̕͜",
        "i̶̡̢̧̛̹̻͖̞͈͓̮͕̩̲͖͍̠̦̞̟̖̙̻̬͈̅̀̋́͐̾̇̏̈̆̐̀͂̐̇͂͛͊̒͋̒̓̏̃̅̂͌̋̏͗͒̃̾̕̕͘͘͠͠͝","j̸̧̡̡̧̡̡̢̨̡̡̮͕̹̹̫̠͙̙̜̗̹̭͖͈̥̳̭͎̪̞͖̺͇̬͕̜͍̘͓͇̤̪̲̈́̑͊́͛̒̉̔̿̕͝ͅ","ķ̸̢̢̛̛͚̭͓̞̭̳̘̦̺̤͚͕̭̰͚͕͍͍̘͇̭̳̓́́̄͒̉̃́̓̔̏̌̔̾̑̌͗̑͆̋̔͗̄̈͗͆̂̇̍̃̅̄̇̃͂͐̋́̂̀̄̓͘͜͝͠͝͝͝ͅͅ",
        "ḻ̵̨̨̢̥͉̠͉̺̥̱̹̦̹̗̖̠͓̝̖̺̰̱̙̟̈́̊͗̍̋̍͋͑̎͌̓̅̅̂̓̐͂̆̃̊͗͛̀̏̂̈̃͂̾̍̄̓̉̈́͋̉͛̃̓͛̊͂̕̕̕͝͝","m̶̡̢̠̘̠̬͉͇͔̫̠̰͇͔͙̻̲̰̲͎͓̯̗̩̓̓̅́͋̿́̎̿̌̂̾͊̀̆̐̈̈̆͒̎͆̐͊̑͌̾̉̀̕͘͜͝͝͝"," ̷̛̛̻̙̔̉̈́̓̈́̈́̏́̈́̈́̾̆̌̂̃̿̿͐̏̆̇͛̐͌̓͐̒̓̆̚͘̚̕͝͠n̴̛͙͓̠͉͎̦̦͉̦͔̼̤̬͙̫͕͍̰̥̟̝̒̆͒̉͂̓̆̏̚͠",
        "ǫ̷̨̧̡̩̹̥̳͕̞͕̜̼̳̩̜̰̱̗̟̬̹̬͎̦̙͇̖̀́̈́̅̈́́̊̾͌̈́̋̚̚ͅͅ","p̸̣̗̼̙̘͉͈̟̟̫̟̟̙͎͈͇̝̊̆̋̓̈̃͜","q̵̡̨̡͕̦̘̖̞̮͉̲̳̖͕͙͖̞̫̖̗̺͖̫̠͖͕̺͍̏̋͑̈́̅́̔̓͋̇́́͂͋̓̎̐͐͘͜͜͜͝͝͝","r̶̡̬̤̣̙̲̫̻̞͔̲̝̟̳̼͓͎̥̙̻͍͈͇̘̰͖͒́̈́̿̓̊̏͌̎͂̀̎͛̓̾͗̀̉̾̆̃͆͒̽̃͒̐͑͋̒̀̍͂͌̍̃̿̾̌͐͗͘̚͜͠͠͝͝͝",
        "ş̵̛̣͉̟̣͎̥̝̘̃̎͂̐̋̔̈́̈́̒̀̌̽̈̂͌̎̊̇́̄̓̆͌́͑̀̐͘͘͜͜͜","t̴̢̛͇̗̤̯͙͖̟̹̦͕̪̪͚̬̰̩̲͙̩̳͇̬̺̟̯͌̿̌̏́͊͛̊̉̈́̂̌̒̓͂͒̉̈̓̀̒̉̋̓͑̋̓̐̎̈́̿̉̂̃̋͆̆̈́̔͒̚͠͠","u̶̟̞̬̙̳̠̹̙͛̈́͑͌̑̏̀̉͛̑̀̔͐̆͘͘̚̕͜͜",
        "ṿ̵̨̡̨̨̡̛͍͓̜͎̣̲̮̼̟̜̜̰̱̮̺̪͔̥͇̯̮̭̝̜͔͚̱̤̳̭̩̳̱͖͕̙̠̯̟̝̯̜͐̊́͂̆̈́̈́̋̎͆̆͋̊̈͒͊̋͆̃͗̅̐́́̚͜͜͝͝͝","ẅ̷̛͚̗͈̝͎͉̱̺̙͎̤͍̰̤̗̪͉͙̬̼̰́̿̾͐̑͋̊̈́͗̏͑̂̍̀͑̂̽̓͛̔̆̐̒́̽̔̋̈́̑̈̏̊̑́̇͐̇̍̚̚͝","ẍ̴̢̡̛̛̬̠͓̘̘͓͔̻͎͎̘̝͎͍̮̣͍̣̣͙͇̩͍̤̝͉͙̻̤̳̱͎̽͑͋̂̇͑̅̋̑̈́̍̊̀̓̉̈́̑̇̀̎̆̊̏̅͛̿̈́̐̍̐̀͂̕͜͜͠͝ͅ",
        "ÿ̶̧̡̢̛̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̽̀́̈́̾̂̐̈́̋̄̿̊̍̂͗̆̇̿̿̒́͝͝","z̵̢̨̨̛̺̣͙̪͉͙͚͖͕̖̗̠͓̼̱̱̤̾̎̃͂̋̋͝"
    };

    public static Dictionary<char, string> alphabetDictionary = new Dictionary<char, string>(){
        //For each letter in the alphabet, add a letter from the scary alphabet
        {'a', "ä̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̒́͝"},
        {'b', "b̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'c', "ç̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'d', "d̶̳̟̱̈́͒̈́̀͗̒́͝"},
        {'e', "ȩ̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'f', "f̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'g', "ģ̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'h', "ḧ̶̳̟̱́͒̈́̀͗̒́͝"},
        {'i', "ḯ̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮͒̈́̀͗̒́͝"},
        {'j', "j̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'k', "ķ̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'l', "l̶̳̟̱̈́͒̈́̀͗̒́͝"},
        {'m', "m̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'n', "ņ̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'o', "ö̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̒́͝"},
        {'p', "p̶̳̟̱̈́͒̈́̀͗̒́͝"},
        {'q', "q̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'r', "ŗ̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'s', "ş̶̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'t', "ẗ̶̳̟̱́͒̈́̀͗̒́͝"},
        {'u', "ǘ̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮͒̈́̀͗̒́͝"},
        {'v', "v̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {'w', "ẅ̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̒́͝"},
        {'x', "ẍ̶̳̟̱́͒̈́̀͗̒́͝"},
        {'y', "ÿ̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮́͒̈́̀͗̒́͝"},
        {'z', "z̶̧̡̢̳̟̱͇̺͈̞̙̝̠̯̺͓̘̖͉͚͍̪̺̞̫̗̗̮̹̙̺̦͍̞̫͍̮̈́͒̈́̀͗̒́͝"},
        {' ', " "},
        {'!', "!"},
        {'"', "\""},
        {'#', "#"},
        {'$', "$"},
        {'%', "%"},
        {'&', "&"},
        {'\'', "'"},
        {'(', "("},
        {')', ")"},
        {'*', "*"},
        {'+', "+"},
        {',', ","},
        {'-', "-"},
        {'.', "."},
        {'/', "/"},
        {':', ":"},
        {';', ";"},
        {'<', "<"},
        {'=', "="},
        {'>', ">"},
        {'?', "?"},
        {'@', "@"},
        {'[', "["},
        {'\\', "\\"},
        {']', "]"},
    };
    
    public static string Get(char c)
    {
        if (alphabetDictionary.ContainsKey(c))
        {
            return alphabetDictionary[c];
        }
        return c.ToString();
    }

    public static string GetRandomLetter(){
        return alphabet[Random.Shared.Next(0,alphabet.Count)];
    }

    internal static string ConvertToDemonSpeech(string inputString){
        string demonString = "";
        foreach (char c in inputString){
            demonString += Get(c);
        }
        return demonString;
    }
}